app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "username", "email", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Mike"], ["username", "mikey"], ["email", "mikey@gmail.com"], ["location", "Lagos"], ["created_at", "2020-05-01 21:22:32.075742"], ["updated_at", "2020-05-01 21:22:32.075742"]]