app/views/layouts/_profile.html.erb

SELECT "followings".* FROM "followings" WHERE "followings"."user_id" = $1  [["user_id", 1]]
---
                    <p class="tweet-stat-title">Followers</p>
                    <p class="tweet-stat-number"><%= @current_user.following.count %></p>